<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>H&eacute;berger des p&eacute;titions au R.A.S.</title><link rel="stylesheet" href="html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.62.0"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="d0e1"></a>H&eacute;berger des p&eacute;titions au R.A.S.</h2></div></div><div></div><hr></div><div class="toc"><dl><dt><span class="section"><a href="#d0e4">1. Introduction</a></span></dt><dd><dl><dt><span class="section"><a href="#d0e7">1.1. Objet du document</a></span></dt><dt><span class="section"><a href="#d0e14">1.2. Pourquoi un syst&egrave;me sp&eacute;cialis&eacute; pour les p&eacute;titions</a></span></dt><dt><span class="section"><a href="#d0e26">1.3. Principes de la validation de signatures</a></span></dt></dl></dd><dt><span class="section"><a href="#d0e56">2. Installation</a></span></dt><dd><dl><dt><span class="section"><a href="#d0e59">2.1. Principe</a></span></dt><dt><span class="section"><a href="#d0e68">2.2. Pr&eacute;-requis</a></span></dt><dt><span class="section"><a href="#d0e81">2.3. Installation de l'installateur</a></span></dt><dt><span class="section"><a href="#d0e114">2.4. Installation du syst&egrave;me de gestion des p&eacute;titions</a></span></dt><dt><span class="section"><a href="#d0e166">2.5. Qu'est-ce qui a &eacute;t&eacute; install&eacute;&nbsp;?</a></span></dt></dl></dd><dt><span class="section"><a href="#d0e188">3. Cr&eacute;ation d'une p&eacute;tition</a></span></dt><dd><dl><dt><span class="section"><a href="#d0e200">3.1. Cr&eacute;ation rapide</a></span></dt><dd><dl><dt><span class="section"><a href="#d0e203">3.1.1. Mise en ligne de la p&eacute;tition</a></span></dt><dt><span class="section"><a href="#d0e224">3.1.2. Saisie des premi&egrave;res signatures</a></span></dt></dl></dd><dt><span class="section"><a href="#d0e246">3.2. Mise en forme de la p&eacute;tition</a></span></dt><dd><dl><dt><span class="section"><a href="#d0e253">3.2.1. Typographie simplifi&eacute;e</a></span></dt><dt><span class="section"><a href="#d0e285">3.2.2. Balises HTML</a></span></dt></dl></dd><dt><span class="section"><a href="#d0e292">3.3. Cr&eacute;ation avanc&eacute;e </a></span></dt><dd><dl><dt><span class="section"><a href="#d0e295">3.3.1. Cr&eacute;ation d'une nouvelle p&eacute;tition</a></span></dt><dt><span class="section"><a href="#d0e316">3.3.2. Fichiers personnalis&eacute;s</a></span></dt></dl></dd><dt><span class="section"><a href="#d0e346">3.4. Pense-b&ecirc;te</a></span></dt></dl></dd><dt><span class="section"><a href="#d0e401">4. Fonctionnement d&eacute;taill&eacute;</a></span></dt><dd><dl><dt><span class="section"><a href="#d0e406">4.1. La Base de donn&eacute;es</a></span></dt><dd><dl><dt><span class="section"><a href="#d0e415">4.1.1. Table petitions</a></span></dt><dt><span class="section"><a href="#d0e460">4.1.2. Table nom_initiative</a></span></dt></dl></dd><dt><span class="section"><a href="#d0e517">4.2. Les fichiers personnalisables</a></span></dt><dd><dl><dt><span class="section"><a href="#d0e522">4.2.1. index.html</a></span></dt><dt><span class="section"><a href="#d0e527">4.2.2. form.html</a></span></dt><dt><span class="section"><a href="#d0e547">4.2.3. ok.html et err.htlm</a></span></dt><dt><span class="section"><a href="#d0e554">4.2.4. mail.txt</a></span></dt><dt><span class="section"><a href="#d0e562">4.2.5. vsign.html</a></span></dt><dt><span class="section"><a href="#d0e567">4.2.6. confirm_ok.html et confirm_err.html</a></span></dt><dt><span class="section"><a href="#d0e572">4.2.7. Les variables substituables</a></span></dt><dt><span class="section"><a href="#d0e676">4.2.8. Les enrichissements typographiques</a></span></dt></dl></dd></dl></dd><dt><span class="section"><a href="#d0e706">5. Installation en images</a></span></dt><dt><span class="section"><a href="#d0e928">6. Installation en shell</a></span></dt></dl></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e4"></a>1.&nbsp;Introduction</h2></div></div><div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e7"></a>1.1.&nbsp;Objet du document</h3></div></div><div></div></div><p>Ce document se voudrait &ecirc;tre une aide compl&egrave;te &agrave; l'installation de p&eacute;titions sur les serveurs du R.A.S. Il s'adresse aux personnes g&eacute;rant les sites web des membres (webmaster) ou, &agrave; d&eacute;faut, aux responsables techniques des associations membres.</p><p>Il suppose que vous savez mettre &agrave; jour le site web de votre association. Si tel n'est pas le cas, ce document ne vous sera d'aucune aide.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e14"></a>1.2.&nbsp;Pourquoi un syst&egrave;me sp&eacute;cialis&eacute; pour les p&eacute;titions</h3></div></div><div></div></div><p>La publication et la gestion d'une p&eacute;tition &eacute;lectronique est techniquement complexe. Par d&eacute;fintion, il s'agit d'un contenu "dynamique" puisque la liste des signataires &eacute;volue au fil du temps. Il faut non seulement archiver les signatures, &eacute;liminer les doublons, &eacute;viter les signatures fantaisistes, etc. Tout cela fait appel &agrave; des techniques qui d&eacute;passent la simple cr&eacute;ation d'une page web "statique" : programmation, base de donn&eacute;es, administration, contr&ocirc;les de s&eacute;curit&eacute;...</p><p>Mais la simplification technique n'est pas la seule motivation. Il nous a paru indispensable d'introduire un minimum de m&eacute;canismes de contr&ocirc;le et de gestion des signatures. Il n'y aurait rien de plus pr&eacute;judiciable que de ne pas pouvoir identifier les signataires d'une p&eacute;tition. Ce serait en contradiction avec le principe m&ecirc;me de ce mode d'action. De m&ecirc;me, si une signature appara&icirc;t plusieurs fois (en raison d'une fausse manipulation) il faut pouvoir effacer rapidement les doublons, faute de quoi on risque vite d'&ecirc;tre accus&eacute;Es de gonfler artificiellement le nombre de signataires... Et si l'on re&ccedil;oit des signatures par d'autres canaux que le Web, il faut pouvoir les ajouter simplement et rapidement.</p><p>Bref, on s'aper&ccedil;oit que quelques fonctionnalit&eacute;s sont absolument indispensables si l'on d&eacute;sire conserver un minimum de cr&eacute;dibilit&eacute; &agrave; ce type d'initiative. Notre but a &eacute;t&eacute; de rendre la <span class="emphasis"><em>p&eacute;tition &eacute;lectronique</em></span> accessible &agrave; toute personne ayant les connaissances suffisantes pour mettre en ligne une page Web "statique".</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e26"></a>1.3.&nbsp;Principes de la validation de signatures</h3></div></div><div></div></div><p>L'un des points fort de cet outil est la validations des signatures. Il ne s'agit pas de proc&eacute;der &agrave; un contr&ocirc;le policier mais de s'assurer, dans la mesure du possible, que la personne qui signe la p&eacute;tition est bien celle qu'elle pr&eacute;tend &ecirc;tre. En clair, il sera demand&eacute; &agrave; chaque signataire de confirmer sa signature. L'engagement demand&eacute; au signataire est plus fort qu'un simple clic, au d&eacute;tour d'une page Web. Est-ce vraiment un d&eacute;faut&nbsp;?</p><p>Vu du c&ocirc;t&eacute; du signataire, la proc&eacute;dure de signature &eacute;lectronique valid&eacute;e appara&icirc;tra ainsi&nbsp;:</p><p></p><div class="itemizedlist"><ul type="disc"><li><p>1 Prise de connaissance du texte de la p&eacute;titions (Web)</p></li><li><p>2 Saisie de son identit&eacute; dans un formulaire &eacute;lectronique (Web)</p></li><li><p>3a Visualisation d'un accus&eacute; d'enregistrement de la demande de signature (Web)</p></li><li><p>3b Visualisation d'un message d'erreur si l'on s'est tromp&eacute; lors de la saisie (Web)</p></li><li><p>4 R&eacute;ception, par courriel, d'une demande de confirmation de la signature (mail)</p></li><li><p>5 Envoi, par courriel, de la confirmation (mail).</p></li><li><p>6 R&eacute;ception, par courriel, d'un accus&eacute; de r&eacute;ception d&eacute;finitif de signature (mail)</p></li></ul></div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e56"></a>2.&nbsp;Installation</h2></div></div><div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e59"></a>2.1.&nbsp;Principe</h3></div></div><div></div></div><p>Plut&ocirc;t que d'installer une p&eacute;tition, nous vous proposons d'installer un outil d'administration de p&eacute;titions. Une fois cet outil install&eacute;, vous pourrez cr&eacute;er autant de p&eacute;titions que vous le voudrez, g&eacute;rer vos listes de signataires, clore une p&eacute;tition, etc.</p><p>Cet outil vous appara&icirc;tra comme une partie du site Web de votre association. Une fois l'installation effectu&eacute;e, vous pourrez g&eacute;rer les p&eacute;titions que vous aurez cr&eacute;&eacute;es &agrave; partir d'un simple navigateur Web.</p><p>Installer le syst&egrave;me de gestion de p&eacute;tition se r&eacute;sume donc &agrave; copier, dans votre espace Web, un ensemble de fichiers con&ccedil;us &agrave; cet effet. Par la suite, la cr&eacute;ation de p&eacute;titions vous conduira &agrave; personnaliser certains des fichiers install&eacute;s. &Agrave; une &eacute;tape comme &agrave; l'autre, vous devez donc disposer des droits d'administration du site Web de votre association.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e68"></a>2.2.&nbsp;Pr&eacute;-requis</h3></div></div><div></div></div><p>Pour pouvoir h&eacute;berger des p&eacute;titions au R.A.S., vous devez d&eacute;j&agrave; disposer d'une base de donn&eacute;es (au R.A.S). Si vous n'en poss&eacute;dez pas une, le responsable technique de votre association peut en faire la demande. Il vous transmettra alors les informations suivantes : nom de la base, login d'administration de la base, mot de passe d'administration de la base.</p><p>Notez bien que c'est la m&ecirc;me base de donn&eacute;es qui vous servira pour une multitudes d'usages. Ainsi, si vous avez d&eacute;j&agrave; install&eacute; SPIP dans l'espace Web de votre association(au R.A.S.), vous disposez forc&eacute;ment d'une base de donn&eacute;es. Inutile d'en cr&eacute;er une nouvelle.</p><p>Par ailleurs, l'installation des p&eacute;titions demandant d'intervenir sur les fichiers de l'espace Web de l'association, celui-ci doit exister et vous devez poss&eacute;der les droits n&eacute;cessaires &agrave; ce type d'intervention (en gros, vous devez &ecirc;tre webmaster)<sup>[<a name="d0e77" href="#ftn.d0e77">1</a>]</sup>.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e81"></a>2.3.&nbsp;Installation de l'installateur</h3></div></div><div></div></div><p>Installer l'outil d'administration de p&eacute;titions revient donc &agrave; ajouter des fichiers sp&eacute;cifiques &agrave; votre site. Cette op&eacute;ration peut &ecirc;tre conduite de nombreuses mani&egrave;re. Nous nous limiterons, ici, &agrave; pr&eacute;senter l'une de celles-ci.</p><p>La premi&egrave;re op&eacute;ration consiste &agrave; r&eacute;cup&eacute;rer l'ensemble des fichiers &agrave; installer. Pour vous les procurer, rendez-vous sur la page du Centre de Ressources consacr&eacute;e aux p&eacute;titions&nbsp;: <a href="http://crras.ras.eu.org/petitions/" target="_top">http://crras.ras.eu.org/petitions/</a><sup>[<a name="d0e90" href="#ftn.d0e90">2</a>]</sup>.Une fois l'archive rapatri&eacute;e sur votre ordi, vous devrez la d&eacute;compacter avant de pouvoir l'implanter sur votre site Web.</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>Pour la suite, nous allons supposer que vous mettez &agrave; jour votre site &agrave; l'aide d'un logiciel de transfert de fichiers par FTP. Si votre site est correctement install&eacute;, vous acc&eacute;dez aux fichiers de votre site par l'url ftp://ftp.&lt;racine du domaine du votre site Web&gt;. Par exemple, si vous tapez http://www.mon_asso.ras.eu.org/ pour surfer sur votre site, ce sera ftp://ftp.mon_asso.ras.eu.org<sup>[<a name="d0e100" href="#ftn.d0e100">3</a>]</sup>.</p></div><p>Connectez-vous &agrave; votre espace Web par FTP (par exemple ftp.asssises-universite.ras.eu.org) et cr&eacute;ez un r&eacute;pertoire (par exemple, <tt class="filename">petitions</tt>)qui aura vocation &agrave; contenir toutes vos p&eacute;titions futures. Dans ce r&eacute;pertoire d&eacute;posez l'ensemble des fichiers et r&eacute;pertoires que vous avez r&eacute;cup&eacute;r&eacute; depuis l'archive. Assurez-vous que la copie du r&eacute;pertoire <tt class="filename">admin</tt> se trouvant sur le site Web est accessible en lecture et en &eacute;criture pour tous. Sinon, ajuster ses droits en cons&eacute;quence, au moyen de votre logiciel d'acc&egrave;s FTP.</p><p>L'installation de l'installateur est termin&eacute;e.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e114"></a>2.4.&nbsp;Installation du syst&egrave;me de gestion des p&eacute;titions</h3></div></div><div></div></div><p>&Agrave; l'&eacute;tape pr&eacute;c&eacute;dente, vous avez install&eacute; l'installateur. Vous allez maintenant activer cet installateur. Ceci entra&icirc;nera l'installation effective du syst&egrave;me de gestion des p&eacute;titions.</p><p>Pour ce faire, vous allez vous rendre dans l'espace Web de votre association, plus pr&eacute;cis&eacute;ment dans la partie <tt class="literal">admin</tt> de l'espace des p&eacute;titions (par exemple <tt class="literal"><tt class="filename">http://www.assises-universite.ras.eu.org/petitions/admin/</tt></tt>).</p><p>Si tout s'est bien pass&eacute;, vous voyez appara&icirc;tre un formulaire vous demandant de fournir quatre informations&nbsp;:</p><div class="itemizedlist"><ul type="disc"><li><p>le nom de domaine de base de base de donn&eacute;es de l'h&eacute;bergeur (ici, le R.A.S.)</p></li><li><p>le nom de la sous-base cr&eacute;&eacute;e pour votre association</p></li><li><p>le login d'administration de cette sous-base</p></li><li><p>le mot de passe d'administration de cette sous-base.</p></li></ul></div><p>Le nom de domaine de la base de donn&eacute;es du R.A.S. est <tt class="literal">db.ras.eu.org</tt>.</p><p>Pour les trois autres informations, elles ne peuvent ni se deviner ni se d&eacute;duire d'autres informations... Soit vous les connaissez, soit vous devez vous les procurer. Elles ont &eacute;t&eacute; fournies &agrave; votre responsable technique, suite &agrave; la cr&eacute;ation de la base de donn&eacute;es de votre association.</p><p>&Agrave; partir de la validation de ce formulaire, une succession d'&eacute;crans vous informe des &eacute;tapes d'installation du syst&egrave;me de p&eacute;tition et vous conduit &agrave; l'&eacute;cran de cr&eacute;ation des administrateurs.</p><p>Vous devez cr&eacute;er au moins un adminstrateur de p&eacute;titions. L'administrateur de la base de donn&eacute;es ne dispose pas automatiquement des droits d'administration des p&eacute;titions. Notez bien les login et mot de passe de ce premier administrateur de p&eacute;titions.</p><p>Apr&egrave;s cr&eacute;ation du premier "admin", vous arrivez sur l'&eacute;cran contr&ocirc;lant l'acc&egrave;s &agrave; l'espace d'adminstration de vos p&eacute;titions.</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>Dor&eacute;navent,  lorsque vous acc&eacute;derez &agrave; l'url d'administration des p&eacute;titions (par exemple <tt class="literal"><tt class="filename">http://www.assises-universite.ras.eu.org/petitions/admin/</tt></tt>) c'est sur cet &eacute;cran que vous tomberez et non sur le formulaire d'installation. Logique, l'installation ne se fait qu'une seule fois.</p></div><p><span class="bold"><b>Entrez dans l'espace d'administration de vos p&eacute;titions.</b></span></p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e166"></a>2.5.&nbsp;Qu'est-ce qui a &eacute;t&eacute; install&eacute;&nbsp;?</h3></div></div><div></div></div><p>Comme vous pouvez le constater sur l'&eacute;cran de gestion de vos p&eacute;titions, l'installateur a cr&eacute;&eacute; une premi&egrave;re p&eacute;tition appel&eacute;e "test". L'existence de cette p&eacute;tition signifie deux choses. D'une part, le syst&egrave;me &agrave; cr&eacute;&eacute; une sous-base de donn&eacute;es (une "table") destin&eacute;e &agrave; recevoir les signatures de cette p&eacute;tition. Mais cela signifie &eacute;galement que certains des fichiers que vous avez d&eacute;pos&eacute; (par FTP) dans votre espace Web sont d&eacute;sormais activ&eacute;s.</p><p>Ainsi, si vous explorez (en FTP) le contenu du sous-r&eacute;pertoire <tt class="filename">modele</tt> de votre r&eacute;pertoire de p&eacute;titions (dans notre exemple <tt class="literal"><tt class="literal">ftp.assises-universite.ras.eu.org/petition/modele/</tt></tt>) vous constaterez qu'il contient un r&eacute;pertoire <tt class="filename">test</tt> qui contient les fichiers mod&egrave;les des pages Web correspondant &agrave; cette p&eacute;tition. Vous y trouverez &eacute;galement un r&eacute;pertoire nomm&eacute; <tt class="filename">defaut</tt>, qui d&eacute;crira les pages Web affich&eacute;es, par d&eacute;faut, pour toutes vos p&eacute;titions futures. Le r&ocirc;le de ces fichiers sera d&eacute;taill&eacute;s dans les sections suivantes.</p><p>Enfin, en plus des donn&eacute;es figurant sous forme de fichiers ou de tables, vous disposez de toute la m&eacute;canique n&eacute;cessaire pour administrer les p&eacute;titions. Les programmes informatiques effectuant ce travail se trouvent dans votre espace Web (sous forme de scripts PHP).</p></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e188"></a>3.&nbsp;Cr&eacute;ation d'une p&eacute;tition</h2></div></div><div></div></div><p>Votre site Web est d&eacute;sormais &eacute;quip&eacute; de tous les outils n&eacute;cessaires pour cr&eacute;er, modifier et g&eacute;rer des p&eacute;titions. Il est donc possible de poursuivre le travail en n'utilisant qu'un simple navigateur Web.</p><p>Si vous adoptez cette d&eacute;marche, vous serez n&eacute;anmoins limit&eacute;E aux affichages d&eacute;finis par d&eacute;faut. Cela peut &ecirc;tre un compromis tout &agrave; fait acceptable puisqu'il permet de mettre en ligne rapidement une p&eacute;tition. Vous pourrez toujours en am&eacute;liorer la pr&eacute;sentation, ult&eacute;rieurement.</p><p>Si vous d&eacute;cidez de personnaliser la pr&eacute;sentation de votre p&eacute;tition, voire de toutes vos p&eacute;titions, vous devrez  intervenir sur les contenu des fichiers et r&eacute;pertoires se trouvant dans le r&eacute;pertoire <tt class="filename">modeles</tt>. Il vous faudra alors proc&eacute;der de la m&ecirc;me mani&egrave;re que lorsqu'on effectue une mise &agrave; jour manuelle d'un site Web (modification des fichiers &agrave; l'aide d'un &eacute;diteur, t&eacute;l&eacute;d&eacute;pot des fichiers modifi&eacute;s ou ajout&eacute;s). Si votre exp&eacute;rience en mati&egrave;re de mise &agrave; jour de sites Web se limite &agrave; l'utilisation "cl&eacute;s en main" d'un syst&egrave;me int&eacute;gr&eacute; tel que SPIP, l'effort que vous devrez fournir risque d'&ecirc;tre cons&eacute;quent. Il peut alors &ecirc;tre judicieux de s'en tenir aux pr&eacute;sentations par d&eacute;faut.</p><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e200"></a>3.1.&nbsp;Cr&eacute;ation rapide</h3></div></div><div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e203"></a>3.1.1.&nbsp;Mise en ligne de la p&eacute;tition</h4></div></div><div></div></div><p>Le moyen le plus rapide de cr&eacute;er une premi&egrave;re p&eacute;tition est de ne pas en cr&eacute;er. Il suffit d'adapter la p&eacute;tition d&eacute;nomm&eacute;e <tt class="literal">test</tt>. Celle-ci appara&icirc;t dans la liste des p&eacute;titions, affich&eacute;e sur l'&eacute;cran d'accueil de l'administration des p&eacute;titions. En cliquant sur le pictogramme d'&eacute;dition des propri&eacute;t&eacute;s, vous pourrez donner de nouveaux titre, sous-titre et texte de p&eacute;tition.</p><p>Il faut &eacute;galement indiquer l'adresse de l'administrateur de la liste. Cette adresse appara&icirc;tra comme &eacute;tant celle de l'exp&eacute;diteur des courriels de demande de confirmation. C'est donc elle qui recevra les r&eacute;ponses &agrave; ces courriels.</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>En r&eacute;ponse &agrave; un courriel de demande de confirmation, le signataire doit, normalement, cliquer sur un lien figurant dans le message qui lui est adress&eacute;. Cela provoque l'envoi d'un courriel destin&eacute; au robot de gestion des p&eacute;tition. Ce courriel ne sera pas envoy&eacute; &agrave; l'administrateur indiqu&eacute; dans ce champ du formulaire.</p><p>Ce dernier ne recevra que les validations erron&eacute;es, par exemple si le signataire utilise la fonction "r&eacute;ponse" de son logiciel de courrier et envoie un message en &eacute;crivant "je confirme".</p></div><p>Le texte de la p&eacute;tition peut &ecirc;tre saisi de la mani&egrave;re la plus simple qui soit&nbsp;: texte seul, avec des sauts de lignes pour s&eacute;parer les paragraphes. On peut n&eacute;anmoins am&eacute;liorer sensiblement le rendu final par l'utilisation de raccourcis de mise en forme typographique (voir plus loin).</p><p>Les boutons radios permettent de pr&eacute;ciser le statut de la p&eacute;tition. Un "brouillon" est une p&eacute;tition en cours de r&eacute;alisation. Un "brouillon" n'est pas consultable sur le Web, en dehors de l'espace d'administration. "&Agrave; signature" permet d'ouvrir la p&eacute;tition &agrave; la signature sur le Web. Une p&eacute;tition en "Archive" peut encore &ecirc;tre consult&eacute;e sur le Web mais on ne peut plus la signer &eacute;lectroniquement.</p><p>La case &agrave; chocher "&Ecirc;tre pr&eacute;venu des nouvelles signatures" permet &agrave; l'administrateur de liste (indentifi&eacute; plus haut) d'&ecirc;tre inform&eacute; des confirmations de signatures. Cela permet de suivre l'&eacute;volution des signatures sans avoir &agrave; se rendre sur le site.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e224"></a>3.1.2.&nbsp;Saisie des premi&egrave;res signatures</h4></div></div><div></div></div><p>Il est courant qu'une p&eacute;tition ait d&eacute;j&agrave; recueilli des signatures avant sa publication en ligne. C'est notamment le cas lorsqu'on a souhait&eacute; asseoir sa cr&eacute;dibilit&eacute; par une liste de premiers signataires repr&eacute;sentatifs. La publication de la p&eacute;tition perdrait beaucoup de sa signification si' l'on ne pouvait imm&eacute;diatement faire figurer ces signatures.</p><p>Dans l'&eacute;cran d'accueil de l'administration des p&eacute;titions, il suffit de cliquer sur le pictogramme d'&eacute;dition des signatures. Un champ permet alors de saisir une liste de signataires, unE par ligne, en respectant un format particulier&nbsp;: <tt class="computeroutput">nom:pr&eacute;nom:infos_compl&eacute;mentaire:primo_signataire.</tt></p><p>Les ":" faisant office de s&eacute;parateurs, il faut les saisir tels quels. "infos_compl&eacute;mentaire" contient ce que l'on veut. "primo_signataire" prend la valeur "1" ou "0" selon que l'on veut, ou non , distinguer visuellement les premiers signataires des signataires suivants.</p><p>Seuls le nom et le pr&eacute;nom doivent imp&eacute;rativement &ecirc;tre indiqu&eacute;s. Une liste du genre&nbsp;:</p><pre class="programlisting">Dupont:Jean
Durand:Jacques</pre><p>est donc parfaitement valable.</p><p>On utilisera ce m&ecirc;me &eacute;cran d'administration pour ajouter, ult&eacute;rieurement, les signatures qui n'auront pas &eacute;t&eacute; r&eacute;colt&eacute;es &agrave; travers le formulaire en ligne.</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>Les signatures saisie par l'administrateur de la p&eacute;tition sont implicitement valid&eacute;es. Il ne sera donc pas demand&eacute; aux signataires de confirmer leur signature. C'est pourquoi on n'a pas &agrave; d'indiquer les adresses E-mail de validation.</p></div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e246"></a>3.2.&nbsp;Mise en forme de la p&eacute;tition</h3></div></div><div></div></div><p>Dans le cas le plus simple, le texte de la p&eacute;tition est saisi tel quel, sans le moindre enrichissement typographique ni le moindre effet de pr&eacute;sentation. Seules sont restitu&eacute;es les s&eacute;parations des paragraphes indiqu&eacute;es lors de la saisie dans le formulaire.</p><p>On peut n&eacute;anmoins souhaiter offrir une meilleure pr&eacute;sentation de ce texte. On dispose alors de deux techniques.</p><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e253"></a>3.2.1.&nbsp;Typographie simplifi&eacute;e</h4></div></div><div></div></div><p>La technique plus simple utilise une syntaxe propre &agrave; notre syst&egrave;me et permet d'effectuer les am&eacute;liorations les plus courantes. Le tableau suivant r&eacute;capitule les directives disponibles.</p><div class="table"><a name="d0e258"></a><p class="title"><b>Table&nbsp;1.&nbsp;Directives typographques simplifi&eacute;es (&agrave; la SPIP)</b></p><table summary="Directives typographques simplifi&eacute;es (&agrave; la SPIP)" border="1"><colgroup><col><col></colgroup><tbody><tr><td>-</td><td>&eacute;l&eacute;ment de liste</td></tr><tr><td>{}</td><td>italique</td></tr><tr><td>{{}}</td><td>gras</td></tr><tr><td>{{{}}}</td><td>intertitre</td></tr></tbody></table></div><p>Il faut comprendre que tout groupe de mots qui, lors de la saisie dans le formulaire, sera encadr&eacute; par "{" et "}" sera affich&eacute; en italique sur le site Web. Les utilisateurs de SPIP ne seront pas d&eacute;pays&eacute;s.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e285"></a>3.2.2.&nbsp;Balises HTML</h4></div></div><div></div></div><p>Les connaisseurs de HTML pourront aller plus avant dans les effets de pr&eacute;sentation du texte de la p&eacute;tition. En effet, les balises HTML qui seront saisies dans le texte du formulaire seront int&eacute;gralement reproduites sur la page Web d'affichage de la p&eacute;tition.</p><p>Ainsi, si le texte d'un paragraphe saisi dans le formulaire est encadr&eacute; par le balises "&lt;center&gt;&lt;/center&gt;", il sera affich&eacute; centr&eacute; sur la page Web.</p></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e292"></a>3.3.&nbsp;Cr&eacute;ation avanc&eacute;e </h3></div></div><div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e295"></a>3.3.1.&nbsp;Cr&eacute;ation d'une nouvelle p&eacute;tition</h4></div></div><div></div></div><p>Si l'on souhaite conserver la p&eacute;tition "test" pour faire des essais ou si l'on doit mettre en ligne une seconde p&eacute;tition, il faut absolument cr&eacute;er une p&eacute;tition de toutes pi&egrave;ces. Pour ce faire, on utilisera le bouton de "cr&eacute;ation" figurant sur l'&eacute;cran d'administration des p&eacute;titions.</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>Pour pouvoir cr&eacute;er des p&eacute;titions, il faut que le r&eacute;pertoire <tt class="filename">modele</tt> situ&eacute; dans votre espace Web soit accessible en &eacute;criture, pour tous (code 777). Utilisez la fonctionnalit&eacute; appropri&eacute;e de votre logiciel FTP, comme vous l'avez fait pour le r&eacute;pertoire <tt class="filename">admin</tt>.</p></div><p>S'affiche alors l'&eacute;cran des propri&eacute;t&eacute;s de la p&eacute;tition, tel qu'il &agrave; &eacute;t&eacute; discut&eacute; dans la section "Cr&eacute;ation rapide".</p><p>Vous constaterez &eacute;galement qu'un nouveau r&eacute;pertoire, reprenant le nom de votre p&eacute;tition, a &eacute;t&eacute; cr&eacute;e dans le r&eacute;pertoire <tt class="filename">modele</tt> de votre site Web. Ce r&eacute;pertoire est vide, c'est normal. Nous discuterons dans les sections suivantes de l'utilisation que l'on peut en faire.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e316"></a>3.3.2.&nbsp;Fichiers personnalis&eacute;s</h4></div></div><div></div></div><p>Pour le moment, nous avons vu comment agir sur la pr&eacute;sentation du texte de la p&eacute;tition. C'est d&eacute;j&agrave; bien et cela conviendra &agrave; de nombreuses personnes, du moins dans l'urgence de la mise en ligne. Mais on peut souhaiter modifier la pr&eacute;sentation compl&egrave;te de la page et pas uniquement la typographie du texte. Plus encore, on peut vouloir intervenir non seulement sur la page du texte de la p&eacute;tition mais aussi sur toutes les pages Web li&eacute;es &agrave; la p&eacute;tition (texte, liste de signataires, formulaire de signature, messages d'alerte) de m&ecirc;me que sur le contenu des courriels (demandes de confirmation, notifications; etc.).</p><p>Tous ces &eacute;l&eacute;ments sont d&eacute;finis par des fichiers figurant dans le r&eacute;pertoire <tt class="filename">modele</tt>. Chaque p&eacute;tition y poss&egrave;de un sous-r&eacute;pertoire qui lui est propre. De plus, le sous-r&eacute;pertoire <tt class="filename">defaut</tt> contient les fichiers qui seront utilis&eacute;s lorsqu'une p&eacute;tition n'a pas d&eacute;fini de fichier personnalis&eacute;. Comme nous l'avons vu pr&eacute;c&eacute;demment, la cr&eacute;ation d'une nouvelle p&eacute;tition provoque la cr&eacute;ation d'un sous-r&eacute;pertoire vide. Cela signifie que cette p&eacute;tition sera, a priori, affich&eacute;e selon les r&egrave;gles par d&eacute;faut d&eacute;crite par les fichiers du sous-r&eacute;pertoire <tt class="filename">defaut</tt>.</p><p>La signification de chaque fichier est d&eacute;taill&eacute;e dans la section "Fichiers personnalisables". Retenons, pour le moment, qu'une p&eacute;tition peut ne personnaliser que l'un de ces fichiers. Si un fichier personnalis&eacute; existe dans le sous-r&eacute;pertoire de la p&eacute;tition, il sera utilis&eacute; en lieu et place du fichier de m&ecirc;me nom situ&eacute; dans le sous-r&eacute;pertoire <tt class="filename">defaut</tt>. Ce m&eacute;canisme permet une personnalisation graduelle<sup>[<a name="d0e337" href="#ftn.d0e337">4</a>]</sup> car elle dispense de proc&eacute;der en "tout ou rien".</p><p>La mani&egrave;re la plus simple de personnaliser est probablement de d&eacute;marrer &agrave; partir d'une copie des fichiers du r&eacute;pertoire <tt class="filename">defaut</tt>. Apr&egrave;s adaptation du (ou des) fichier(s) d&eacute;sir&eacute;(s), &agrave; l'aide d'un &eacute;diteur, il suffira de le(s) t&eacute;l&eacute;d&eacute;poser dans le r&eacute;pertoire de la p&eacute;tition.</p></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e346"></a>3.4.&nbsp;Pense-b&ecirc;te</h3></div></div><div></div></div><p>L'id&eacute;e de cette section est de r&eacute;capituler toutes les op&eacute;rations &agrave; effectuer, pour une installation rapide.</p><div class="orderedlist"><ol type="1"><li><p>Se procurer toutes les informations n&eacute;cessaires</p><div class="itemizedlist"><ul type="disc"><li><p>le nom syst&egrave;me R.A.S. de votre association</p></li><li><p>le nom de domaine de votre site Web h&eacute;berg&eacute; au R.A.S.</p></li><li><p>les login et mots de passe permettant de g&eacute;rer l'espace Web</p></li><li><p>le nom de la base de donn&eacute;es de votre association, au R.A.S.</p></li><li><p>le login et mot de passe permettant d'acc&eacute;der &agrave; cette base de donn&eacute;es</p></li></ul></div></li><li><p>R&eacute;cup&eacute;rer l'installateur</p></li><li><p>T&eacute;l&eacute;d&eacute;poser l'installateur</p><div class="itemizedlist"><ul type="disc"><li><p>donner les droits d'&eacute;criture &agrave; tous sur le r&eacute;pertoire <tt class="filename">admin</tt></p></li><li><p>donner les droits d'&eacute;criture &agrave; tous sur le r&eacute;pertoire <tt class="filename">modele</tt></p></li></ul></div></li><li><p>Lancer l'installation en passant par le site Web de l'association</p></li><li><p>Adapter la p&eacute;tition "test"</p><div class="itemizedlist"><ul type="disc"><li><p>modifier ses propri&eacute;t&eacute;s&nbsp;: titre, sous-titre, texte, mail d'administration, statut</p></li><li><p>ajouter les premiers signataires</p></li></ul></div></li></ol></div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e401"></a>4.&nbsp;Fonctionnement d&eacute;taill&eacute;</h2></div></div><div></div></div><p>Le syst&egrave;me d'administration des p&eacute;titions fonctionne avec un ensemble de fichiers pour chacune des op&eacute;rations et une base de donn&eacute;es. Chaque p&eacute;tition utilise son jeu de fichiers situ&eacute; dans le r&eacute;pertoire modele/nom_petition du sous-espace Web que vous avez consacr&eacute; aux p&eacute;titions.</p><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e406"></a>4.1.&nbsp;La Base de donn&eacute;es</h3></div></div><div></div></div><p>C'est une base Mysql comportant une table d&eacute;crivant l'ensemble des p&eacute;titions g&eacute;r&eacute;es par la R.A.S. (en cours ou pass&eacute;es).</p><p>Les base sont g&eacute;rables par phpmyadmin: <a href="https://www.ras.eu.org/admin/pma/index.php" target="_top">https://www.ras.eu.org/admin/pma/index.php</a></p><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e415"></a>4.1.1.&nbsp;Table <tt class="literal">petitions</tt></h4></div></div><div></div></div><div class="table"><a name="d0e420"></a><p class="title"><b>Table&nbsp;2.&nbsp;table petitions</b></p><table summary="table petitions" border="1"><colgroup><col><col></colgroup><tbody><tr><td>ide</td><td>num&eacute;ro de la p&eacute;tition (auto-incr&eacute;ment)</td></tr><tr><td>nom</td><td>le nom interne de l'initiative. Il sera utilis&eacute; pour chercher les signature, et les mod&egrave;les</td></tr><tr><td>en_ligne</td><td>indique si la p&eacute;tition est signable (1) ou finie (0). On pourra ajouter d'autre valeur pour consultable par exemple.</td></tr><tr><td>texte</td><td>contient le texte de la p&eacute;tition</td></tr><tr><td>date_init</td><td>date de lancement, au format YYYY-MM-JJ</td></tr><tr><td>initiateurs</td><td>indique s'il y a une liste des initiateurs (semble non utilis&eacute;)</td></tr><tr><td>titre et sous-titre</td><td>pour la mise en page</td></tr></tbody></table></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e460"></a>4.1.2.&nbsp;Table <tt class="literal">nom_initiative</tt></h4></div></div><div></div></div><p>&Agrave; chaque initiative est associ&eacute;e une table de signatures portant le nom utilis&eacute; dans la table petitions. La table contient toutes les signatures&nbsp;: premiers signataires, signataires suivants, signatures en cours de validation. Cette table comporte les champs suivants</p><div class="table"><a name="d0e467"></a><p class="title"><b>Table&nbsp;3.&nbsp;table nom_initiative</b></p><table summary="table nom_initiative" border="1"><colgroup><col><col></colgroup><tbody><tr><td>ide</td><td>le num&eacute;ro assign&eacute; &agrave; la p&eacute;tition dans la table pr&eacute;c&eacute;dente</td></tr><tr><td>level</td><td>'0' signature 'normale', '1' initiateur</td></tr><tr><td>valid</td><td>'0' en cours de validation, '1' valid&eacute;e</td></tr><tr><td>Nom</td><td>information r&eacute;cup&eacute;r&eacute;e dans le formulaire</td></tr><tr><td>Prenom</td><td>information r&eacute;cup&eacute;r&eacute;e dans le formulaire</td></tr><tr><td>email</td><td>information r&eacute;cup&eacute;r&eacute;e dans le formulaire</td></tr><tr><td>infos</td><td>information r&eacute;cup&eacute;r&eacute;e dans le formulaire</td></tr><tr><td>date</td><td>timestamp des modifications</td></tr><tr><td>cookie</td><td>la cl&eacute; MD5. Apr&egrave;s validation cette cl&eacute; est supprim&eacute;e</td></tr></tbody></table></div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e517"></a>4.2.&nbsp;Les fichiers personnalisables</h3></div></div><div></div></div><p>Les contenu des pages Web affich&eacute;es et des messages envoy&eacute;s par courriel sont d&eacute;finis dans huit fichiers (sept fichiers HTML et un fichier texte). Certains fichiers peuvent contenir des "variables" qui seront remplac&eacute;es, lors de l'utilisation, par des donn&eacute;es puis&eacute;es dans la base de donn&eacute;es.</p><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e522"></a>4.2.1.&nbsp;index.html</h4></div></div><div></div></div><p>C'est le fichiers qui servira &agrave; produire la page Web d'entr&eacute;e dans la p&eacute;tition. Il devrait comporter le texte de la p&eacute;tition, et un lien vers le formulaire de signature. Gr&acirc;ce aux variables susbstituables (voir plus loin), il peut y ins&eacute;rer le nombre de signatures d&eacute;j&agrave; recueillies, et la listes de signataires et/ou un lien vers ces informations.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e527"></a>4.2.2.&nbsp;form.html</h4></div></div><div></div></div><p>C'est le fichier qui servira &agrave; produire la page Web du formulaire de saisie des signatures. Ce formulaire doit comporter 4 champs qui doivent s'appeler comme indiqu&eacute;):</p><div class="itemizedlist"><ul type="disc"><li><p>nom (nom)</p></li><li><p>pr&eacute;nom (prenom)</p></li><li><p>divers (infos)</p></li><li><p>mail (email)</p></li></ul></div><p>On peut y faire figurer des variables susbstituables.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e547"></a>4.2.3.&nbsp;ok.html et err.htlm</h4></div></div><div></div></div><p>Ce sont les fichiers utilis&eacute;s pour produire des pages Web affich&eacute;es lors de la validation de la saisie du formulaire. Suivant que les informations fournies par l'utilisateur seront conformes ou non aux formats attendus ou non par notre logiciel, l'une ou l'autre page sera affich&eacute;e.</p><p>En fait, c'est sans grande importance, le seul risque &eacute;tant de perdre quelques signatures. On verra a am&eacute;liorer avec un test minimal.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e554"></a>4.2.4.&nbsp;mail.txt</h4></div></div><div></div></div><p>C'est un fichier texte. Il est envoy&eacute; par mail et utilise ses propres variables substituables. Il doit imp&eacute;rativement comporter la variable <tt class="literal">#LIEN</tt> qui est le lien cliquable de validation form&eacute; d'une cl&eacute; MD5, a priori unique.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e562"></a>4.2.5.&nbsp;vsign.html</h4></div></div><div></div></div><p>Affichage des signataires.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e567"></a>4.2.6.&nbsp;confirm_ok.html et confirm_err.html</h4></div></div><div></div></div><p>Ce sont les fichier appel&eacute; lors d'une confirmation suivant que la cl&eacute; est reconnue ou pas.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e572"></a>4.2.7.&nbsp;Les variables substituables</h4></div></div><div></div></div><p>Les fichiers personnalisables peuvent contenir des <span class="emphasis"><em>variables</em></span>.Ces variables seront remplac&eacute;es par du texte. Les variables utilisables d&eacute;pendent du type de fichier concern&eacute;. </p><div class="section" lang="en"><div class="titlepage"><div><div><h5 class="title"><a name="d0e580"></a>4.2.7.1.&nbsp;Fichiers HTML</h5></div></div><div></div></div><div class="table"><a name="d0e583"></a><p class="title"><b>Table&nbsp;4.&nbsp;variables pour fichiers HTML</b></p><table summary="variables pour fichiers HTML" border="1"><colgroup><col><col></colgroup><tbody><tr><td>#TITRE</td><td>extraction du champs titre de la base de donn&eacute;es</td></tr><tr><td>#SOUS_TITRE</td><td>extraction du champs sous-titre de la base de donn&eacute;es</td></tr><tr><td>#TEXTE</td><td>extraction du champs texte de la base de donn&eacute;es</td></tr><tr><td>#IDE</td><td>num&eacute;ro de la p&eacute;tition (utile pour cr&eacute;er des liens</td></tr><tr><td>#INITIATEURS</td><td>listes des premiers signataires s'il y en a</td></tr><tr><td>#DATE_INIT</td><td>date de lancement de la p&eacute;tition (jj mois yyyy)</td></tr><tr><td>#DATE</td><td>aujourd'hui (jj mois yyyy)</td></tr><tr><td>#COUNT</td><td>nombre de signatures valid&eacute;es</td></tr><tr><td>#SIGNATAIRES</td><td>liste ordonn&eacute;es alphab&eacute;tiquement des signatures avec infos</td></tr><tr><td>#SIGNER</td><td>lien complet vers le formulaire de signature</td></tr><tr><td>#VOIR</td><td>lien complet vers la visualisation des signatures</td></tr></tbody></table></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h5 class="title"><a name="d0e643"></a>4.2.7.2.&nbsp;Fichier mail.txt</h5></div></div><div></div></div><div class="table"><a name="d0e646"></a><p class="title"><b>Table&nbsp;5.&nbsp;variables pour fichiers de mail</b></p><table summary="variables pour fichiers de mail" border="1"><colgroup><col><col></colgroup><tbody><tr><td>#NOM</td><td>le champs nom saisie dans le formulaire</td></tr><tr><td>#PRENOM</td><td>le champs pr&eacute;nom saisie dans le formulaire</td></tr><tr><td>#EMAIL</td><td>le champs email saisie dans le formulaire</td></tr><tr><td>#INF</td><td>le champs infos saisie dans le formulaire</td></tr><tr><td>#LIEN</td><td>le lien de validation, avec sa cl&eacute; MD5</td></tr></tbody></table></div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e676"></a>4.2.8.&nbsp;Les enrichissements typographiques</h4></div></div><div></div></div><p>Les fichiers HTML peuvent contenir des directives d'enrichissement simplifi&eacute;es qui &eacute;vitent d'avoir &agrave; recourir aux possibilit&eacute;s de HTML ou de des feuilles de styles.</p><div class="table"><a name="d0e681"></a><p class="title"><b>Table&nbsp;6.&nbsp;Directives simplifi&eacute;es (&agrave; la SPIP)</b></p><table summary="Directives simplifi&eacute;es (&agrave; la SPIP)" border="1"><colgroup><col><col></colgroup><tbody><tr><td>-</td><td>&eacute;l&eacute;ment de liste</td></tr><tr><td>{}</td><td>italique</td></tr><tr><td>{{}}</td><td>gras</td></tr><tr><td>{{{}}}</td><td>intertitre</td></tr></tbody></table></div></div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e706"></a>5.&nbsp;Installation en images</h2></div></div><div></div></div><p>Cet exemple en images est tir&eacute; d'un ordi personnel, fonctionnant sous GNU-Linux (distribution Mandrake 10.0 standard), dans l'environnement de bureau KDE.</p><p></p><p></p><div class="figure"><a name="d0e713"></a><p class="title"><b>Figure&nbsp;1.&nbsp;Je vais sur le serveur FTP public du R.A.S.</b></p><div class="mediaobject"><img src="resources/ftpras.png" alt="Je vais sur le serveur FTP public du R.A.S."></div></div><p></p><div class="figure"><a name="d0e720"></a><p class="title"><b>Figure&nbsp;2.&nbsp;Je r&eacute;cup&egrave;re l'archive sur mon ordi, dans un dossier local cr&eacute;&eacute; &agrave; cet effet</b></p><div class="mediaobject"><img src="resources/cparchive.png" alt="Je r&eacute;cup&egrave;re l'archive sur mon ordi, dans un dossier local cr&eacute;&eacute; &agrave; cet effet"></div></div><p>Je d&eacute;compacte l'archive (op&eacute;ration "extraire ici" du nagivateur de KDE) dans ce r&eacute;petoire.</p><div class="figure"><a name="d0e728"></a><p class="title"><b>Figure&nbsp;3.&nbsp;Je d&eacute;compacte l'archive...</b></p><div class="mediaobject"><img src="resources/extract.png" alt="Je d&eacute;compacte l'archive..."></div></div><div class="figure"><a name="d0e734"></a><p class="title"><b>Figure&nbsp;4.&nbsp;...et voil&agrave; le r&eacute;sultat</b></p><div class="mediaobject"><img src="resources/extracted.png" alt="...et voil&agrave; le r&eacute;sultat"></div></div><p>Je me connecte, en FTP, &agrave; l'espace web de mon association&nbsp;: <tt class="literal">ftp://ftp.assises-universite.ras.eu.org/</tt>.</p><div class="figure"><a name="d0e745"></a><p class="title"><b>Figure&nbsp;5.&nbsp;j'arrive dans l'espace web de toutes les associations h&eacute;berg&eacute;es au R.A.S. :(</b></p><div class="mediaobject"><img src="resources/ftpwebras.png" alt="j'arrive dans l'espace web de toutes les associations h&eacute;berg&eacute;es au R.A.S. :("></div></div><p>Encore un effort pour arriver dans l'espace de mon asso. Ici, le nom-syt&egrave;me de l'association est <tt class="filename">au</tt>.</p><div class="figure"><a name="d0e756"></a><p class="title"><b>Figure&nbsp;6.&nbsp;et je cr&eacute;e un dossier <tt class="filename">petitions</tt></b></p><div class="mediaobject"><img src="resources/ftpwebau1.png" alt="et je cr&eacute;e un dossier petitions"></div></div><div class="figure"><a name="d0e764"></a><p class="title"><b>Figure&nbsp;7.&nbsp;et voil&agrave; le travail</b></p><div class="mediaobject"><img src="resources/ftpwebau2.png" alt="et voil&agrave; le travail"></div></div><p>Je dois, maintenant, t&eacute;l&eacute;d&eacute;poser le contenu d&eacute;compat&eacute; dans mon nouveau dossier distant (inutile de d&eacute;poser l'archive elle-m&ecirc;me).</p><div class="figure"><a name="d0e772"></a><p class="title"><b>Figure&nbsp;8.&nbsp;t&eacute;l&eacute;d&eacute;p&ocirc;t par un simple glisser-d&eacute;poser</b></p><div class="mediaobject"><img src="resources/upload.png" alt="t&eacute;l&eacute;d&eacute;p&ocirc;t par un simple glisser-d&eacute;poser"></div></div><p>Je modifie les droits d'&eacute;criture des r&eacute;pertoires <tt class="filename">admin</tt> et <tt class="filename">modele</tt>. Dans cette interface (KDE),je dois cocher les deux cases cercl&eacute;es de rouge.</p><div class="figure"><a name="d0e786"></a><p class="title"><b>Figure&nbsp;9.&nbsp;j'acc&egrave;de aux propri&eacute;t&eacute;s des r&eacute;pertoires</b></p><div class="mediaobject"><img src="resources/chown.png" alt="j'acc&egrave;de aux propri&eacute;t&eacute;s des r&eacute;pertoires"></div></div><p>Ouf ! J'ai fini d'installer l'installateur. Je vais maintenant l'activer.</p><p>Avec mon navigateur Web, j'acc&egrave;de &agrave; l'url d'administration des p&eacute;titions, dans l'espace web de mon association&nbsp;: <tt class="literal">http://www.assises-universite.ras.eu.org/petitions/admin/.</tt></p><div class="figure"><a name="d0e798"></a><p class="title"><b>Figure&nbsp;10.&nbsp;Si j'avais oubli&eacute; de modifier les droits de r&eacute;pertoires admin et modele, j'aurais eu ce message d'alerte...</b></p><div class="mediaobject"><img src="resources/pbdroits.png" alt="Si j'avais oubli&eacute; de modifier les droits de r&eacute;pertoires admin et modele, j'aurais eu ce message d'alerte..."></div></div><p><tt class="literal"></tt></p><div class="figure"><a name="d0e806"></a><p class="title"><b>Figure&nbsp;11.&nbsp;Mais comme j'ai pas oubli&eacute;, j'arrive sur l'&eacute;cran d'installation</b></p><div class="mediaobject"><img src="resources/install1.png" alt="Mais comme j'ai pas oubli&eacute;, j'arrive sur l'&eacute;cran d'installation"></div></div><p></p><div class="figure"><a name="d0e813"></a><p class="title"><b>Figure&nbsp;12.&nbsp;et je saisis toutes le infos demand&eacute;es.</b></p><div class="mediaobject"><img src="resources/install1full.png" alt="et je saisis toutes le infos demand&eacute;es."></div></div><p></p><div class="figure"><a name="d0e820"></a><p class="title"><b>Figure&nbsp;13.&nbsp;Tout semble bien se passer...</b></p><div class="mediaobject"><img src="resources/install2.png" alt="Tout semble bien se passer..."></div></div><p>Je cr&eacute;e le premier administrateur de mes p&eacute;titions. Il m'en faut au moins un&nbsp;!</p><p></p><div class="figure"><a name="d0e829"></a><p class="title"><b>Figure&nbsp;14.&nbsp;Je cr&eacute;e mon premier administrateur</b></p><div class="mediaobject"><img src="resources/creeadmin.png" alt="Je cr&eacute;e mon premier administrateur"></div></div><p>J'arrive enfin &agrave; l'&eacute;cran contr&ocirc;lant l'acc&egrave;s &agrave; l'espace d'administration de mes p&eacute;titions. &Ccedil;a signifie que j'ai termin&eacute; l'installation du syst&egrave;me de gestion des p&eacute;titions. D&eacute;sormais, si je tape l'url <tt class="literal">http://www.assises-universite.ras.eu.org/petitions/admin/</tt>, j'arriverai sur cet &eacute;cran. </p><div class="figure"><a name="d0e840"></a><p class="title"><b>Figure&nbsp;15.&nbsp;et voil&agrave; l'&eacute;cran de contr&ocirc;le d'acc&egrave;s</b></p><div class="mediaobject"><img src="resources/cntrladmin.png" alt="et voil&agrave; l'&eacute;cran de contr&ocirc;le d'acc&egrave;s"></div></div><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>Avant de poursuivre, je dois m'assurer que mon navigateur acc&egrave;pte les cookies et javascript. J'abandonne Konqueror et sa configuration rigide pour Mozilla avec des r&eacute;glages mous...</p></div><p>Je n'ai qu'&agrave; taper les login et mot de passe du premier adaministrateur (que je viens de cr&eacute;er)...</p><p></p><div class="figure"><a name="d0e852"></a><p class="title"><b>Figure&nbsp;16.&nbsp;...et me voici sur l'&eacute;cran d'accueil d'administration des p&eacute;titions</b></p><div class="mediaobject"><img src="resources/adminpet.png" alt="...et me voici sur l'&eacute;cran d'accueil d'administration des p&eacute;titions"></div></div><p>Je constate qu'il existe d&eacute;j&agrave; une p&eacute;tition <tt class="literal">test</tt>. Je vais l'adapter pour b&acirc;tir ma premi&egrave;re p&eacute;tition. Pour ce faire, je vais &eacute;diter les <span class="emphasis"><em>propri&eacute;t&eacute;s</em></span> de la p&eacute;tition. Je clique sur le pictogramme des propri&eacute;t&eacute;s...</p><p></p><div class="figure"><a name="d0e867"></a><p class="title"><b>Figure&nbsp;17.&nbsp;Je n'ai plus qu'&agrave; saisir tous les champs et demander la publication en ligne (bouton radio "&Agrave; signature".</b></p><div class="mediaobject"><img src="resources/proprietes.png" alt="Je n'ai plus qu'&agrave; saisir tous les champs et demander la publication en ligne (bouton radio &#34;&Agrave; signature&#34;."></div></div><p>J</p><p></p><div class="figure"><a name="d0e876"></a><p class="title"><b>Figure&nbsp;18.&nbsp;l'&eacute;cran des propri&eacute;t&eacute;s, bien rempli</b></p><div class="mediaobject"><img src="resources/proprietesfull.png" alt="l'&eacute;cran des propri&eacute;t&eacute;s, bien rempli"></div></div><p>D&egrave;s que je valide, je me retouve devant d'accueil d'administration. Si je clilque sur le nom de la p&eacute;tition, je vais tout suite voir comment elle sera pr&eacute;sent&eacute;e aux internautes.</p><p></p><div class="figure"><a name="d0e885"></a><p class="title"><b>Figure&nbsp;19.&nbsp;Et voil&agrave; l'travail&nbsp;! Fautes de frappe comprises...</b></p><div class="mediaobject"><img src="resources/affichepet.png" alt="Et voil&agrave; l'travail&nbsp;! Fautes de frappe comprises..."></div></div><p>Avant de passer &agrave; autre chose, <span class="bold"><b>Je prends note de l'url de cette page</b></span> (ici, <tt class="literal">http://www.assises-universite.ras.eu.org/petitions/?petition=1</tt>) car c'est celui qu'il faudra indiquer si je veux placer un lien vers ma p&eacute;tition, dans une page Web ou un courriel.</p><p>Je reviens en arri&egrave;re (sur l'&eacute;cran d'accueil d'administration)  et je clique sur le pictogramme des signatures, juste &agrave; gauche du picto des propri&eacute;t&eacute;s.</p><p></p><div class="figure"><a name="d0e902"></a><p class="title"><b>Figure&nbsp;20.&nbsp;Je saisis les premi&egrave;res signatures, histoire de montrer que je ne suis pas tout seul.</b></p><div class="mediaobject"><img src="resources/sigfull.png" alt="Je saisis les premi&egrave;res signatures, histoire de montrer que je ne suis pas tout seul."></div></div><p>J'ai bien saisi mes signatures. Le syst&egrave;me les a toutes accept&eacute;es et il me le fait savoir. Je vais voir si elles sont visibles pour les internautes. Je passe par la liste de mes p&eacute;titions disponibles &agrave; la consultation : http://www.assises-universite.ras.eu.org/petitions/</p><div class="figure"><a name="d0e910"></a><p class="title"><b>Figure&nbsp;21.&nbsp;C'est pauvre, mais ce n'est qu'un d&eacute;but... la p&eacute;tition continue&nbsp;!</b></p><div class="mediaobject"><img src="resources/afflistpet.png" alt="C'est pauvre, mais ce n'est qu'un d&eacute;but... la p&eacute;tition continue&nbsp;!"></div></div><p></p><p>Il n'y en a qu'une, je la s&eacute;lectionne. Je retrouve le texte de ma p&eacute;tition et je clique sur le lien "Voir les signatures".</p><p></p><div class="figure"><a name="d0e920"></a><p class="title"><b>Figure&nbsp;22.&nbsp;Les signatures, telles que les verront les internautes.</b></p><div class="mediaobject"><img src="resources/affichsig.png" alt="Les signatures, telles que les verront les internautes."></div></div><p>J'ai fini. J'ai mis mon texte en ligne, j'ai entr&eacute; mes permier signataires et j'ai not&eacute; l'url de ma p&eacute;tition pour pouvoir l'annoncer au monde&nbsp;!</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e928"></a>6.&nbsp;Installation en shell</h2></div></div><div></div></div><p>Seule l'installation de l'installateur diff&egrave;re de la proc&eacute;dure expos&eacute;e ci-avant. Une fois celle-ci r&eacute;alis&eacute;e, l'activation de l'installateur et la cr&eacute;ation des p&eacute;titions s'effectue via le Web.</p><pre class="programlisting">ssh bibi@marcos.ras.eu.org
cd /var/www/mon_asso
mkdir petitions ; cd petitions
tar -x ~crras/petitions/phpPetitions.tgz</pre><p>L'installateur est install&eacute;. Les r&eacute;pertoires poss&egrave;dent les bons attributs. Rendez-vous, via le Web, dans le r&eacute;pertoire <tt class="filename">petitions/admin</tt> que vous venez d'installer.</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d0e77" href="#d0e77">1</a>] </sup>Toutes ces informations doivent vous &ecirc;tre transmises par le responsable technique de votre association.</p></div><div class="footnote"><p><sup>[<a name="ftn.d0e90" href="#d0e90">2</a>] </sup>Les archives sont directement disponibles dans l'espace FTP anonyme du R.A.S.&nbsp;: <a href="ftp://ftp.ras.eu.org/petitions/" target="_top">ftp://ftp.ras.eu.org/public/petitions/</a>. Mais il est conseill&eacute; de passer d'abord par la page Web. Celle-ci peut contenir des informations de derni&egrave;re minute.</p></div><div class="footnote"><p><sup>[<a name="ftn.d0e100" href="#d0e100">3</a>] </sup>Attention ! ftp://tp.mon_asso.ras.eu.org vous conduit dans le r&eacute;pertoire contenant tous les espaces Web h&eacute;berg&eacute;s au R.A.S. Pour acc&eacute;der &agrave; votre espace Web, vous devez ouvrir le r&eacute;pertoire de votre association. Ce r&eacute;pertoire ne porte pas n&eacute;cessairement le m&ecirc;me nom que celui qui a servit &agrave; composer votre nom de domaine !!! C'est le nom interne qui a &eacute;t&eacute; assign&eacute; &agrave; votre association, lors de la cr&eacute;ation de votre tout premier compte.</p></div><div class="footnote"><p><sup>[<a name="ftn.d0e337" href="#d0e337">4</a>] </sup>Granulaire.</p></div></div></div></body></html>