<div class="jumbotron">
<p>L'utilisation du service gratuit d'annonces est soumis &agrave; l'acceptation pleine et enti&egrave;re par l'utilisateur des pr&eacute;sentes conditions d'utilisation et vaut acceptation par l'utilisateur des conditions d'utilisation.<br />Le site <?php echo $sitename; ?> se r&eacute;serve le droit, &agrave; sa discr&eacute;tion, de ne pas diffuser une quelconque annonce ou de supprimer &agrave; tout moment toute annonce sans que l'annonceur puisse pr&eacute;tendre &agrave; quelque indemnisation que ce soit.<br />Le site <?php echo $sitename; ?> d&eacute;cline toute responsabilit&eacute; concernant les annonces pass&eacute;es dans le service annonces.</p>
<p class="font-weight-bold">L'utilisation du service d'annonces se fait sous la seule responsabilit&eacute; de ses utilisateurs qui assument la totalit&eacute; des risques pouvant en d&eacute;couler.</p>
<p class="text-info">Toutes les annonces ont par d&eacute;faut une dur&eacute;e de vie de <?php echo $obsol; ?> mois.</p>
<p>Libre au d&eacute;positaire de supprimer son ou ses annonces ou d'en prolonger la dur&eacute;e de parution directement (avec son mot de passe) en revalidant son ou ses annonces, ou de demander &agrave; l'&eacute;quipe du site de supprimer ou de prolonger l'annonce ou les annonces en question.<br />Le service d'annonces collecte certaines informations personnelles permettant directement ou indirectement d'identifier l'utilisateur. Ces informations ne sont en aucune fa&ccedil;on divulgu&eacute;es, donn&eacute;es ou vendues &agrave; quiconque.<br />Conform&eacute;ment aux dispositions de la loi n&deg; 78-17 du 6 janvier 1978 (loi informatique et libert&eacute;), l'utilisateur peut <?php echo '<a class="btn btn-primary-outline btn-sm" href="mailto:'.$adminmail.'"><i class="fa fa-envelope-o" aria-hidden="true"></i> Envoyer</a>'; ?> pour exercer ses droits de consultation, de modification et de retrait de toutes donn&eacute;es personnelles port&eacute;es &agrave; la connaissance du site <?php echo $sitename; ?>.<br />Le site <?php echo $sitename; ?> se r&eacute;serve le droit de modifier ou d'interrompre &agrave; tout moment tout ou partie du service d'annonces gratuites et se r&eacute;serve le droit de refuser &agrave; tout utilisateur, l'acc&egrave;s &agrave; tout ou partie du site sans notification.</p>
</div>