<div class="jumbotron">
<p>La dur&eacute;e de parution des annonces est de <strong><?php echo $obsol; ?> mois</strong>, vous pouvez prolonger cette dur&eacute;e simplement en affichant votre annonce par le menu <strong>passer/gérer mes annonces</strong> et en cliquant simplement sur le bouton <strong>modifier</strong>. Cette action revalide votre annonce pour une durée de parution de <?php echo $obsol; ?> mois.</p>
<p class="text-danger text-xs-center font-weight-bold"><i class="fa fa-info-circle" aria-hidden="true"></i> Votre annonce ne sera pas mise en ligne imm&eacute;diatement, un mod&eacute;rateur devra la valider.</p>
<p>Vous pouvez &eacute;galement modifier le contenu de votre annonce &agrave; partir de cette m&ecirc;me page. Le fait de faire une modification implique une nouvelle validation du mod&eacute;rateur. Pour supprimer votre annonce, cliquez sur le bouton <strong>supprimer</strong>.</p>
<p>Lorsque vous d&eacute;posez une annonce, essayez d'&ecirc;tre <strong>le plus explicite, le plus complet et le plus clair possible</strong></p>
<p><strong>Pr&eacute;cisez un maximum de renseignements</strong> quand &agrave; l'offre ou la demande que vous formulez, les annonces incompl&egrave;tes n'attirent personne.</p>
<p>Ecrivez en caract&egrave;res minuscules, n'indiquez pas votre adresse e-mail dans le texte de votre annonce, elle sera automatiquement affich&eacute;e (tout du moins celle que vous avez d&eacute;clar&eacute;e en vous inscrivant sur le site) ni votre/vos num&eacute;ro(s) de t&eacute;l&eacute;phone, il y a un champ r&eacute;serv&eacute; pour cela.</p>
<p>Nous vous offrons la possibilit&eacute; de d&eacute;poser une annonce gratuitement, faites l'effort de bien r&eacute;diger votre annonce, merci.</p>
<p>Les annonceurs doivent suivre scrupuleusement cette petite proc&eacute;dure, pas de liens vers d'autres sites sans cela il ne sera pas donn&eacute; suite &agrave; votre demande.</p>
<p>Pour ins&eacute;rer une photo dans un article, merci d'utiliser l'outil de pr&eacute;paration en cliquant sur <a class="btn btn-secondary btn-sm" href="modules.php?ModPath=npds_annonces&ModStart=photosize"><i class="fa fa-picture-o" aria-hidden="true"></i> Outil</a></p>

<p>Placer ensuite le curseur clignotant à l'endroit o&ugrave; vous voulez mettre la photo puis cliquer sur l'icone t&eacute;l&eacute;chargement <i class="mce-ico mce-i-none" style="background-image: url('http://labo.infocapagde.com/editeur/tinymce/plugins/npds/images/npds_upload.png')"></i> de l'&eacute;diteur int&eacute;gr&eacute;, cela ouvrira une petite fen&ecirc;tre, vous indiquez le fichier photo pr&eacute;par&eacute; qui se trouve sur votre bureau et cliquez sur le bouton joindre, votre photo arrivera dans l'&eacute;diteur.</p>

</div>